# Bonus: Temperature Analysis I

In [260]:
import pandas as pd
from datetime import datetime as dt
from scipy.stats import ttest_ind
import numpy as np
from scipy import stats

In [261]:
from scipy.stats import ttest_ind
import datetime as dt

In [262]:
%matplotlib inline
from matplotlib import style
style.use('fivethirtyeight')
import matplotlib.pyplot as plt
import datetime as dt

In [263]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func

In [264]:
# create engine to hawaii.sqlite
engine = create_engine("sqlite:///hawaii.sqlite")

In [265]:
# reflect an existing database into a new model
Base = automap_base()
# reflect the tables
Base.prepare(engine, reflect=True)

In [266]:
# View all of the classes that automap found
Base.classes.keys()

['measurement', 'station']

In [267]:
# Save references to each table
measurement = Base.classes.measurement
station = Base.classes.station

In [289]:
# "tobs" is "temperature observations"
df = pd.read_csv('hawaii_measurements.csv')
# Show results
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [274]:
print (df.dtypes)

station            object
date       datetime64[ns]
prcp              float64
tobs                int64
month               int64
dtype: object

In [291]:
# Convert the date column format from string to datetime
df['date'] = pd.to_datetime(df['date'])
df.date = pd.to_datetime(df.date, infer_datetime_format=True)
# Show results
df.head()

       station       date  prcp  tobs
0  USC00519397 2010-01-01  0.08    65
1  USC00519397 2010-01-02  0.00    63
2  USC00519397 2010-01-03  0.00    74
3  USC00519397 2010-01-04  0.00    76
4  USC00519397 2010-01-06   NaN    73

In [305]:
# Set the date column as the DataFrame index
df.set_index(df['date'], drop=False, append=False, inplace=False, verify_integrity=False).drop('date', 1)

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73
...                 ...   ...   ...
2017-08-19  USC00516128  0.09    71
2017-08-20  USC00516128   NaN    78
2017-08-21  USC00516128  0.56    76
2017-08-22  USC00516128  0.50    76
2017-08-23  USC00516128  0.45    76

[19550 rows x 3 columns]

In [306]:
# Drop the date column
df.reset_index(drop=True, inplace=True)

# Show results
df.head()

       station       date  prcp  tobs
0  USC00519397 2010-01-01  0.08    65
1  USC00519397 2010-01-02  0.00    63
2  USC00519397 2010-01-03  0.00    74
3  USC00519397 2010-01-04  0.00    76
4  USC00519397 2010-01-06   NaN    73

### Compare June and December data across all years

In [307]:
from scipy import stats

In [308]:
# Create our session (link) from Python to the DB
session = Session(engine)

In [309]:
# Filter data for desired months (June)
june = session.query(measurement.date, measurement.tobs).filter(func.strftime("%m", measurement.date)=="06")
june
# Show the dataframe
june_df = pd.DataFrame(june)
# Show results
june_df

            date  tobs
0     2010-06-01  78.0
1     2010-06-02  76.0
2     2010-06-03  78.0
3     2010-06-04  76.0
4     2010-06-05  77.0
...          ...   ...
1695  2017-06-26  79.0
1696  2017-06-27  74.0
1697  2017-06-28  74.0
1698  2017-06-29  76.0
1699  2017-06-30  75.0

[1700 rows x 2 columns]

In [310]:
# Filter data for desired months (Dec)
dec = session.query(measurement.date, measurement.tobs).filter(func.strftime("%m", measurement.date)=="12")
dec
# Show the dataframe
dec_df = pd.DataFrame(dec)
# Show results
dec_df

            date  tobs
0     2010-12-01  76.0
1     2010-12-03  74.0
2     2010-12-04  74.0
3     2010-12-06  64.0
4     2010-12-07  64.0
...          ...   ...
1512  2016-12-27  71.0
1513  2016-12-28  71.0
1514  2016-12-29  69.0
1515  2016-12-30  65.0
1516  2016-12-31  65.0

[1517 rows x 2 columns]

In [311]:
# Identify the average temperature for June
# Identify the average temperature for December
average_temp = pd.DataFrame([{"month": "June", "Average Temp": june_df["tobs"].mean()}, 
                             {"month": "Dec", "Average Temp": dec_df["tobs"].mean()}])
# Show results
average_temp

  month  Average Temp
0  June     74.944118
1   Dec     71.041529

In [312]:
# Create collections of temperature data
june_average = june_df["tobs"]
dec_average = dec_df["tobs"]

# Show results
june_average, dec_average

(0       78.0
 1       76.0
 2       78.0
 3       76.0
 4       77.0
         ...
 1695    79.0
 1696    74.0
 1697    74.0
 1698    76.0
 1699    75.0
 Name: tobs, Length: 1700, dtype: float64,
 0       76.0
 1       74.0
 2       74.0
 3       64.0
 4       64.0
         ...
 1512    71.0
 1513    71.0
 1514    69.0
 1515    65.0
 1516    65.0
 Name: tobs, Length: 1517, dtype: float64)

In [313]:
stats.ttest_ind(june_average, dec_average)

Ttest_indResult(statistic=31.60372399000329, pvalue=3.9025129038616655e-191)

In [314]:
# Close Session
session.close()

### Analysis

The temps are close in some places but not fully consistent to believe that they fully follow a pattern.